/******************************************************************************
*	JHdebug.h
*	JH的个人debug文件
*	定义相应的全局变量和宏定义
*******************************************************************************/



#ifndef _JH_DEBUG_
#define _JH_DEBUG_


//	============================================================================
//	debug宏定义
//	============================================================================

#define			JH_IS_DEBUGING			1				//我的debug开关

//	============================================================================
//	调试用类
//	============================================================================

class JHdebug
{
public:
	JHdebug();
	~JHdebug();
		
	static unsigned int timesOfAmpJudge;				//统计进行AMP模式判决的次数
	static unsigned int timesOfUsingAmp;				//统计AMP模式判决后采用AMP模式的次数（不代表最终结果）

private:

};


#endif // !_JH_DEBUG_